# import matplotlib.pyplot as plt
# import pandas as pd
# import seaborn as sns

# # Данные для примера
# x = [1, 2, 3, 4, 5]
# y = [2, 4, 1, 3, 5]

# # Строим график
# plt.plot(x, y)
# plt.title("Мой первый график в VS Code")
# plt.show()

from pprint import pprint

# Как создать матрицу 3x3 из нулей так, чтобы изменение matrix[0][0] не затронуло другие строки?
#[
#    [0, 0, 0],
#    [0, 0, 0],
#    [0, 0, 0],
#]

matrix = [[0] * 3 for _ in range(3)]
matrix[2][2] = 9999
print(matrix)

a = [1, 2, 1, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 2]
b = a
a[:] = []
print(b)
print(a)

# Как очистить список a, чтобы b тоже стал пустым? (2 способа)